package src.learnGubin.lesson3.task1;

/**
 * Создать класс "Правильная дробь" с числитель, знаменательРеализовать в классе методы:
 * - конструктор по умолчанию;
 * - конструктор с параметрами;
 * - метод Выразить значение дроби в процентах;
 * - метод Найти сумму чисел значений знаменателя и числителя;
 * Создать класс "Дробная метаматематика" со статическими методами (в каждом возвращается новая дробь)
 * - метод Суммирования дробей
 * - метод вычитание дробей;
 * - метод умножение дробей;
 * - метод деления дробей;
 * Создать проект для демонстрации работы
 */
public class Fractions {
    public static void main(String[] args) {

    }
}
